jira/conf-man.yml
---
settings:
  artifacts-dir: results/%Y-%m-%d_%H-%M-%S
  aggregator: consolidator
  verbose: false
  env:
    application_hostname:  dcstack-698709169.eu-central-1.elb.amazonaws.com
    application_protocol: http      # http or https
    application_port: 80 # 80, 443, 8080, 2990, etc
    application_postfix:           # e.g. /jira in case of url like http://localhost:2990/jira
    admin_login: admin
    admin_password: admin
    concurrency: 200
    test_duration: 25m
    WEBDRIVER_VISIBLE: False
    JMETER_VERSION: 5.1
services:
  - module: shellexec
    prepare:
      - python util/prepare-data.py ${application_protocol}://${application_hostname}:${application_port}${application_postfix}
    shutdown:
      - python util/jtl_convertor/jtls-to-csv.py kpi.jtl
execution:
  - scenario: jmeter
    concurrency: ${concurrency}
    hold-for: ${test_duration}
    ramp-up: 3m
scenarios:
  jmeter:
    script: jmeter/conf-man.jmx
    properties:
      application_hostname: ${application_hostname}
      application_protocol: ${application_protocol}
      application_port: ${application_port}
      application_postfix: ${application_postfix}
      # Workload model
      total_actions_per_hr: 98000
      perc_create_component_version: 10
      perc_browse_component_version: 14
      perc_use_component_version: 20
      perc_create_bundle: 5
      perc_browse_bundle: 9
      perc_browse_release_notes: 2
      perc_search_jql: 4
      perc_browse_subcomponent: 7
      perc_browse_subproject: 3
      perc_get_subcomponent: 16
      perc_get_subproject: 8
      perc_browse_version_hierarchy: 2
modules:
  consolidator:
    rtimes-len: 0 # CONFSRVDEV-7631 reduce sampling
    percentiles: [] # CONFSRVDEV-7631 disable all percentiles due to Taurus's excessive memory usage
  jmeter:
    version: ${JMETER_VERSION}
    detect-plugins: true
    memory-xmx: 8G  # allow JMeter to use up to 8G of memory
    plugins:
      - bzm-parallel=0.4
      - bzm-random-csv=0.6
      - jpgc-casutg=2.5
      - jpgc-dummy=0.2
      - jpgc-ffw=2.0
      - jpgc-fifo=0.2
      - jpgc-functions=2.1
      - jpgc-json=2.6
      - jpgc-perfmon=2.1
      - jpgc-prmctl=0.4
      - jpgc-tst=2.4
      - jpgc-wsc=0.3
      - tilln-sshmon=1.0
      - jpgc-cmd=2.2
      - jpgc-synthesis=2.2
    system-properties:
      server.rmi.ssl.disable: true
      java.rmi.server.hostname: localhost
      httpsampler.ignore_failed_embedded_resources: "true"